import React from 'react'

export const CompanyPoliticy = () => {
  return (
    <div>
      <h3>1. Общие положения</h3>
      <h4>
        1.1. Настоящая Политика конфиденциальности (далее — Политика) определяет порядок обработки и
        защиты персональных данных, предоставляемых пользователями в связи с использованием услуг
        интернет-магазина одежды, принадлежащего индивидуальному предпринимателю (далее — ИП).
      </h4>
      <h4>
        1.2. Политика разработана в соответствии с законодательством Республики Беларусь, включая
        Закон Республики Беларусь от 7 мая 2021 года № 99-З &quot;О защите персональных
        данных&quot;.
      </h4>
      <h4>
        1.3. Использование услуг ИП, включая посещение сайта интернет-магазина https://0606.store/,
        оформление заказов и подписку на рассылки, означает согласие пользователя с данной Политикой
        и условиями обработки его персональных данных.
      </h4>
      <h4>
        1.4. Пользователь обязуется ознакомиться с настоящей Политикой перед использованием сайта,
        оформлением заказа и предоставлением персональных данных.
      </h4>
      <h3>2. Персональные данные</h3>
      <h4>
        2.1. Персональные данные включают любую информацию, позволяющую идентифицировать физическое
        лицо (субъекта персональных данных), такую как:
      </h4>
      <ul>
        <li>ФИО</li> <li>контактные данные (телефон, электронная почта, адрес доставки).</li>
        <li>
          данные для обработки оплаты (например, информация о платежных системах, последние 4 цифры
          банковской карты).
        </li>
        <li>
          история заказов и предпочтения в покупках; иная информация, предоставленная пользователем
          через формы обратной связи или при оформлении заказа.
        </li>
      </ul>
      <h4>2.2. ИП обрабатывает персональные данные для следующих целей:</h4>
      <ul>
        <li>оформления и доставки заказов.</li> <li>информирования о статусе заказа.</li>
        <li>предоставления доступа к персонализированным предложениям и акционным предложениям</li>
        <li>выполнения требований законодательства</li>
        <li>анализа пользовательских предпочтений для улучшения качества услуг.</li>
      </ul>
      <h3>3. Принципы обработки персональных данных</h3>
      <h4>3.1. Обработка персональных данных осуществляется на законной и справедливой основе.</h4>
      <h4>3.2. ИП собирает только те данные, которые необходимы для выполнения указанных целей.</h4>
      <h4>
        3.3. ИП принимает все необходимые меры для обеспечения точности и актуальности персональных
        данных.
      </h4>
      <h4>
        3.4. Хранение персональных данных осуществляется не дольше, чем это требуется для достижения
        целей их обработки.
      </h4>
      <h3>4. Права субъектов персональных данных</h3>
      <h4>4.1. Субъект персональных данных имеет право:</h4>
      <ul>
        <li>на получение информации об обработке своих данных на доступ к своим данным.</li>
        <li>на исправление, блокирование или удаление своих данных.</li>
        <li>на отзыв согласия на обработку данных (в случаях, предусмотренных законом)</li>
        <li>на подачу жалобы в уполномоченные органы.</li>
      </ul>
      <h3>5. Обеспечение безопасности данных</h3>
      <h4>
        5.1. ИП принимает организационные и технические меры для защиты персональных данных от:
      </h4>
      <ul>
        <li>несанкционированного доступа.</li> <li>утраты или изменения.</li>
        <li>неправомерного использования.</li>
      </ul>
      <h4>
        5.2. Доступ к персональным данным предоставляется только уполномоченным лицам, обязанным
        соблюдать конфиденциальность.
      </h4>
      <h3>6. Передача данных третьим лицам</h3>
      <h4>
        6.1. ИП не передает персональные данные третьим лицам без согласия субъекта, за исключением
        случаев, предусмотренных законодательством Республики Беларусь.
      </h4>
      <h4>6.2. Передача данных третьим лицам может осуществляться:</h4>
      <ul>
        <li>по запросу государственных органов в рамках их полномочий.</li>
        <li>
          в целях исполнения заказа, включая передачу данных службам доставки и платёжным системам.
        </li>
      </ul>
      <h3>7. Политика использования файлов cookie</h3>
      <h4>
        7.1. Сайт интернет-магазина использует файлы cookie для обеспечения удобства пользователей,
        а также для анализа и улучшения работы сайта.
      </h4>
      <h4>
        7.2. Cookie — это небольшие текстовые файлы, которые сохраняются на устройстве пользователя
        при посещении сайта. Они помогают:
      </h4>
      <ul>
        <li>сохранять информацию о содержимом корзины.</li>
        <li>запоминать настройки и предпочтения пользователя.</li>
        <li>анализировать поведение посетителей на сайте.</li>
        <li>показывать персонализированные предложения и рекламу.</li>
      </ul>
      <h4>
        7.3. Пользователь может управлять файлами cookie в настройках своего браузера, включая их
        полное удаление или запрет на использование.
      </h4>
      <h4>
        7.4. Отключение файлов cookie может повлиять на работоспособность некоторых функций сайта,
        таких как оформление заказов или вход в личный кабинет.
      </h4>
      <h3>8. Изменения Политики</h3>
      <h4>8.1. ИП оставляет за собой право вносить изменения в настоящую Политику.</h4>
      <h4>
        8.2. Новая редакция Политики вступает в силу с момента её размещения на официальном сайте
        https://0606.store/, если иное не предусмотрено Политикой.
      </h4>
      <h3>9. Заключительные положения</h3>
      <h4>
        9.1. Настоящая Политика конфиденциальности действует до момента её отмены или замены новой
        редакцией.
      </h4>
      <h4>
        9.2. Пользователь, продолжая использование услуг интернет-магазина после публикации
        обновлений Политики, автоматически принимает внесённые изменения.
      </h4>
      <h4>
        9.3. ИП обязуется предпринимать все возможные меры для защиты персональных данных
        пользователей и обеспечения их конфиденциальности.
      </h4>
    </div>
  )
}
