import React from 'react';

export const PaymentDelivery = () => {
  return (
    <div>
      <h3>1. Способы доставки</h3>
      <h4>
        Доставка осуществляется логистической компанией СДЕК на основании договора №IM-BY-MOG7-21.
        Иные способы доставки согласуются заранее вместе с Исполнителем.
      </h4>
      <h3>2. Форму для доставки клиент заполняет при оформлении заказа</h3>
      <ul>
        <li>1. Способ доставки</li>
        <li>2. ФИО получателя</li>
        <li>3. Страна получателя</li>
        <li>4. Город получателя</li>
        <li>
          5. Адрес доставки (пункт выдачи/почтовое отделение/адрес проживание, если выбрана доставка
          курьером)
        </li>
        <li>6. Почтовый индекс</li>
        <li>7. Адрес электронной почты</li>
        <li>8. Номер телефона</li>
      </ul>
      <h3>3. Общие положения о доставке</h3>
      <h4>3.1. Общие условия</h4>
      <ul>
        <li>
          3.1.1. Доставка товара осуществляется на основании заказа, оформленного покупателем через
          сайт или другим способом, согласованным с продавцом.
        </li>
        <li>
          3.1.2. Продавец обязуется выполнить доставку товара в сроки, указанные на сайте или в
          соглашении. Сроки могут варьироваться в зависимости от местоположения покупателя и наличия
          товара на складе.
        </li>
        <li>
          3.1.3. Данные для отслеживания заказа, в виде трек-номера или номера заказа выдаются по
          средствам личного обращения по контактам указанных в форме для заказа товара
        </li>
      </ul>
      <h3>3.2. Сроки доставки</h3>
      <ul>
        <li>
          3.2.1. Продавец обязуется выполнить доставку товара в срок, указанный в момент оформления
          заказа, но не позднее, чем через 7 рабочих дней с момента подтверждения заказа (если не
          указано иное).
        </li>
        <li>
          3.2.2. Сроки могут быть изменены в случае форс-мажора или непредвиденных обстоятельств, о
          которых покупатель будет уведомлен заранее.
        </li>
      </ul>
      <h3>3.3. Стоимость доставки</h3>
      <ul>
        <li>
          3.3.1. Стоимость доставки зависит от выбранного способа доставки, веса и габаритов товара,
          а также от адреса доставки.
        </li>
        <li>
          3.3.2. Стоимость доставки будет указана при оформлении заказа и добавлена к общей сумме.
        </li>
      </ul>
      <h3>3.4. Ответственность за повреждения</h3>
      <ul>
        <li>
          3.4.1. Продавец несет ответственность за товар до момента передачи его покупателю или его
          представителю.
        </li>
        <li>
          3.4.2. Покупатель обязуется осмотреть товар при получении и, в случае обнаружения
          повреждений, незамедлительно сообщить об этом курьеру или представителю службы доставки, а
          также уведомить продавца в течение 24 часов.
        </li>
      </ul>
      <h3>3.5. Отказ от доставки</h3>
      <ul>
        <li>3.5.1. Покупатель имеет право отказаться от товара до момента его отправки.</li>
        <li>
          3.5.2. В случае отказа от товара после отправки покупатель обязан покрыть расходы,
          связанные с возвратом товара.
        </li>
      </ul>
      <h3>3.6. Особые условия доставки</h3>
      <ul>
        <li>
          3.6.1. В случае доставки товара в удаленные или труднодоступные районы возможны
          дополнительные расходы, которые будут согласованы с покупателем до оформления заказа.
        </li>
        <li>
          3.6.2. Продавец оставляет за собой право изменять условия доставки в зависимости от
          обстоятельств, о чем покупатель будет уведомлен.
        </li>
      </ul>
    </div>
  );
};
